// @references
// https://baike.baidu.com/item/%E5%B8%B8%E7%94%A8%E5%AD%97
// http://www.gov.cn/zwgk/2013-08/19/content_2469793.htm
export const WORDS =
  '的一是在不了有和人这中大为上个国我以要他' +
  '时来用们生到作地于出就分对成会可主发年动' +
  '同工也能下过子说产种面而方后多定行学法所' +
  '民得经十三之进着等部度家电力里如水化高自' +
  '二理起小物现实加量都两体制机当使点从业本' +
  '去把性好应开它合还因由其些然前外天政四日' +
  '那社义事平形相全表间样与关各重新线内数正' +
  '心反你明看原又么利比或但质气第向道命此变' +
  '条只没结解问意建月公无系军很情者最立代想' +
  '已通并提直题党程展五果料象员革位入常文总' +
  '次品式活设及管特件长求老头基资边流路级少' +
  '图山统接知较将组见计别她手角期根论运农指' +
  '几九区强放决西被干做必战先回则任取据处队' +
  '南给色光门即保治北造百规热领七海口东导器' +
  '压志世金增争济阶油思术极交受联什认六共权' +
  '收证改清己美再采转更单风切打白教速花带安' +
  '场身车例真务具万每目至达走积示议声报斗完' +
  '类八离华名确才科张信马节话米整空元况今集' +
  '温传土许步群广石记需段研界拉林律叫且究观' +
  '越织装影算低持音众书布复容儿须际商非验连' +
  '断深难近矿千周委素技备半办青省列习响约支' +
  '般史感劳便团往酸历市克何除消构府称太准精' +
  '值号率族维划选标写存候毛亲快效斯院查江型' +
  '眼王按格养易置派层片始却专状育厂京识适属' +
  '圆包火住调满县局照参红细引听该铁价严龙飞'

// @references
// https://baike.baidu.com/item/%E7%99%BE%E5%AE%B6%E5%A7%93/194637
export const FIRST_NAMES =
  '赵 钱 孙 李 周 吴 郑 王 冯 陈 褚 卫 蒋 沈 韩 杨 朱 秦 尤 许' +
  '何 吕 施 张 孔 曹 严 华 金 魏 陶 姜 戚 谢 邹 喻 柏 水 窦 章' +
  '云 苏 潘 葛 奚 范 彭 郎 鲁 韦 昌 马 苗 凤 花 方 俞 任 袁 柳' +
  '酆 鲍 史 唐 费 廉 岑 薛 雷 贺 倪 汤 滕 殷 罗 毕 郝 邬 安 常' +
  '乐 于 时 傅 皮 卞 齐 康 伍 余 元 卜 顾 孟 平 黄 和 穆 萧 尹' +
  '姚 邵 湛 汪 祁 毛 禹 狄 米 贝 明 臧 计 伏 成 戴 谈 宋 茅 庞' +
  '熊 纪 舒 屈 项 祝 董 梁 杜 阮 蓝 闵 席 季 麻 强 贾 路 娄 危' +
  '江 童 颜 郭 梅 盛 林 刁 钟 徐 邱 骆 高 夏 蔡 田 樊 胡 凌 霍' +
  '虞 万 支 柯 昝 管 卢 莫 经 房 裘 缪 干 解 应 宗 丁 宣 贲 邓' +
  '郁 单 杭 洪 包 诸 左 石 崔 吉 钮 龚 程 嵇 邢 滑 裴 陆 荣 翁' +
  '荀 羊 於 惠 甄 麴 家 封 芮 羿 储 靳 汲 邴 糜 松 井 段 富 巫' +
  '乌 焦 巴 弓 牧 隗 山 谷 车 侯 宓 蓬 全 郗 班 仰 秋 仲 伊 宫' +
  '宁 仇 栾 暴 甘 钭 厉 戎 祖 武 符 刘 景 詹 束 龙 叶 幸 司 韶' +
  '郜 黎 蓟 薄 印 宿 白 怀 蒲 邰 从 鄂 索 咸 籍 赖 卓 蔺 屠 蒙' +
  '池 乔 阴 郁 胥 能 苍 双 闻 莘 党 翟 谭 贡 劳 逄 姬 申 扶 堵' +
  '冉 宰 郦 雍 舄 璩 桑 桂 濮 牛 寿 通 边 扈 燕 冀 郏 浦 尚 农' +
  '温 别 庄 晏 柴 瞿 阎 充 慕 连 茹 习 宦 艾 鱼 容 向 古 易 慎' +
  '戈 廖 庾 终 暨 居 衡 步 都 耿 满 弘 匡 国 文 寇 广 禄 阙 东' +
  '殴 殳 沃 利 蔚 越 夔 隆 师 巩 厍 聂 晁 勾 敖 融 冷 訾 辛 阚' +
  '那 简 饶 空 曾 毋 沙 乜 养 鞠 须 丰 巢 关 蒯 相 查 後 荆 红' +
  '游 竺 权 逯 盖 益 桓 公 万俟 司马 上官 欧阳 夏侯 诸葛' +
  '闻人 东方 赫连 皇甫 尉迟 公羊 澹台 公冶 宗政 濮阳' +
  '淳于 单于 太叔 申屠 公孙 仲孙 轩辕 令狐 钟离 宇文' +
  '长孙 慕容 鲜于 闾丘 司徒 司空 亓官 司寇 仉 督 子车' +
  '颛孙 端木 巫马 公西 漆雕 乐正 壤驷 公良 拓跋 夹谷' +
  '宰父 谷梁 晋 楚 闫 法 汝 鄢 涂 钦 段干 百里 东郭 南门' +
  '呼延 归 海 羊舌 微生 岳 帅 缑 亢 况 后 有 琴 梁丘 左丘' +
  '东门 西门 商 牟 佘 佴 伯 赏 南宫 墨 哈 谯 笪 年 爱 阳 佟' +
  '第五 言 福'

// @references
// http://www.zhxia.net/2018/392885.html
export const LAST_NAMES =
  '禾瑞 俊洁 烨廉 旺儒 传丞 雨橙 传凯 欣贤 峪阳 睿烨 御嘉 皓宣 志恒 曦晖 俊韦' +
  '沐栩 兴怀 浩瀚 军呈 锶源 逸扬 宜窈 柏羽 文乾 昱千 斓智 昌旭 萌宸 昊恒 旭冰' +
  '伯维 程弘 名楷 星宇 羽杭 玺卓 御森 家仁 双权 皓洪 立鹏 智贤 硕良 永志 羽菡' +
  '韶宁 懿宇 弛奕 鹏科 东晗 越超 睿裕 颢仁 熙臣 梦晨 喆逸 学坤 予纬 辰予 启容' +
  '德帆 铭昕 云墨 尧嘉 鼎华 恩诺 含铭 尚迪 嘉尉 亦杰 宇洺 优凯 延晗 皓斌 梓天' +
  '一翔 歆栎 礼焱 子希 丞阳 传珲 可炫 璟程 启伟 飞章 梓齐 玺雨 硕存 语澜 尘坤' +
  '语晰 宁启 承玮 含蕴 璟泓 天好 艳学 殊择 昱泓 育鹏 铸存 尚权 尚慕 虹儒 颜艺' +
  '昱灏 江哲 坚成 若彦 晗悦 佳翔 安博 美轩 楷呈 泽熔 瑞伟 书旺 崇渊 兴元 宸灝' +
  '鸿江 顺祥 航哲 里宸 锦嗥 筠熙 瑞真 昱升 涵玮 抒从 曦辰 亭风 成奕 慕羽 景龙' +
  '秋伟 玮骏 尚能 誉程 宸啸 若圻 啸予 鑫榕 江琰 景予 义敏 奕深 宁峪 捷阳 言臣' +
  '轩尹 歆渝 伯坤 桦烨 云翔 少安 胤彬 翔裕 翌铭 悠宸 晖然 景弈 晓谦 楷德 欣博' +
  '鹏涛 奕承 悦勤 睿曦 潇岩 馨乐 玮弘 龙浩 修涵 音炎 开欣 梓沁 悦如 安科 语楚' +
  '宇祺 绍坤 峪浛 雨奚 宸润 远颢 奕民 梓纾 雨育 辰烁 豪博 龙凯 治卿 天沛 赟俊' +
  '和祥 昭伟 吉楠 继 海罡' +

  '桦 朕 谦 苓 利 基 颔 耀 锦 乔 韦 钢 歌 飒 骏 舱 振 澉 英 焘 涓' +
  '崇 达 华 涛 珑 卿 波 广 璟 禅 驹 阔 亨 溢 驰 俯 恬 震 娟 珺 榕' +
  '泉 瑞 澎 凤 刚 礼 富 谚 冠 部 万 高 吉 炎 凌 容 瑾 大 聚 雄 易' +
  '生 固 钦 颔 理 光 韩 诤 承 展 辅 斌 圣 昭 康 儒 采 睿 颜 政 益' +
  '海 彤 景 谱 弛 盈 沧 殿 佚 励 议 庆 代 星 之 翰 彦 尧 军 鑫 茹' +
  '山 立 鹏 畅 垒 镇 绮 功 俊 隆 襦 采 竣 劭 河 豪 福 敬 亦 迎 博' +
  '巩 瀚 艺 善 若 贵 臻 襦 融 力 进 朗 弓 罡 全 增 喆 梁 锐 骅 钊' +
  '升 纲 为 以 森 亮 义 正 毅 宜 哲 奕 逸 琛 铠 澔 频 候 艺 澉 滢' +
  '鹰 意 菁 真 照 钧 社 晷 铖 基 超 淇 聪 征 胜 迅 亿 晋 帝 筠 凯' +
  '科 章 佳 浦 砂 谊 寒 诚 彰 茵 来 兴 丞 晟 瀛 靖 登 合 缜 稹 国' +

  '彦婌 抒如 虹羽 安莲 芮霞 莉哲 昕珑 语煊 淑婷 毓笛 可祺 妤然 钰妍 敏云 梓珂' +
  '曼欣 耘忆 宸薇 梦淇 含晴 梦溪 语芩 杉然 卓语 晨妤 曼睿 宣笛 嘉言 小喧 宛轩' +
  '昕泉 柔淑 梦华 雅慧 蓉欣 雯姝 淇鸣 姿丹 嘉晔 晓欣 心宜 晨柔 耘莉 钥琀 语茹' +
  '蕾盛 昕琼 莉暄 含琀 灏嘉 抒多 羽煌 睿铭 梓箮 亦甜 毓桦 宇哲 雪琪 玉芳 文鸣' +
  '笛美 芩芳 美妤 斯蕊 笑妍 颜萧 寄玉 涵兰 好宁 悦聆 慕晴 寄香 悉怡 晨樱 晨倩' +
  '婌煜 锦诗 显莉 曼宸 金娇 艺栌 宣宜 思瑾 可千 书羽 祺煜 姝采 琬洳 夜睿 晴瑶' +
  '鹭睫 海彤 耘亦 菀毓 子彤 秀婷 祺茗 毓琀 泓霄 妤嫣 忆晴 遥琴 羽斐 宁飞 婷淑' +
  '函童 含煜 元抒 予忆 宇颍 毓婉 书睫 毓意 春哲 聍嘉 逍莹 雨唯 亚聪 话焓 琳潞' +
  '潇妮 芯霏 濡宸 茗迪 宇沁 雅珊 舒扬 诒芩 文灿 文函 翌采 晗琳 斓意 芝宁 珂欣' +
  '涵筱 香谣 羽含 羽旭 佳昊 羽谊 舒华 宇旭 湘霏 芯照 紫然 玥娴 昔妍 小艳 淑优' +
  '雯昕 婿莹 姗儒 语诗 辰哲 云儒 睿琴 婌琳 溢琼 玥姻 逍笛 婉宁 蓉羽 琴煊 玥玥' +
  '意琳 雨儇 清润 佳淳 依心 喻宁 初晨 睿骐 馨微 文夕 呈妍 梅妍 岚纾 听春 子妙' +
  '熙楹 曼歆 馨可 圣彤 姝心 睿萱 浠宇 玥心 誉云 潇菡 文玥 睿莉 琴晔 芮蓉 予丽' +
  '芮予 婉棋 诗宣 彤婕 函祺' +

  '梅 梦 楠 檀 欢 欣 歆 毓 水 洁 晓 菡 茗 雯 慧 敏 南 寻 慕 蕊 雪 海 璇 宛' +
  '诗 语 贞 采 钰 银 雅 雨 忆 念 怀 怜 思 怡 情 玉 爱 姿 惠 娇 媛 妩 萱 娈' +
  '瑷 悠 香 沛 薇 瑶 语 菱 瑾 琪 忆 柳 桃 慕 兰 岚 柔 蓉 安 蓝 春 语 绮 晴' +
  '棋 芹 萍 幻 露 灵 含 雅 伊 伶 佳 依 俞 俪 倩 偲 琼 冰 姗 姝 珂 珊 彩 心' +
  '嘉 囡 女 如 妃 妍 妙 妮 漪 漫 澜 灵 玥 玫 环 玲 瑶 珍 谷 荷 画 巧 希 彤'

// @referces
// https://baike.baidu.com/item/手机号码/1417348
export const PHONE_PREFIX =
  '130 131 132 133 134 135 136 137 138 139 145 147 149 150 151 152 153 155' +
  '156 157 158 159 166 171 172 173 175 176 177 178 180 181 182 183 184 185' +
  '186 187 188 189 198 199'
